src/QuanLyHeThongComApp/test/TestSuaNhom/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyHeThongComApp">
  <soapenv:Body>
    <quan:SuaNhomOperation>
      <idNhom>6</idNhom>
      <tenNhom>hocsinh</tenNhom>
      <moTa>hoc</moTa>
    </quan:SuaNhomOperation>
  </soapenv:Body>
</soapenv:Envelope>